<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Package the current Git commit of the master branch of autopkg.
This is not used to obtain the latest released version.
</string>
	<key>Identifier</key>
	<string>com.github.autopkg.AutoPkgGitMaster</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>autopkg</string>
		<key>URL</key>
		<string>https://github.com/autopkg/autopkg/zipball/master</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>%URL%</string>
			</dict>
			<key>Comment</key>
			<string>Download latest autopkg zip archive</string>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/source</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%destination_path%</string>
			</dict>
			<key>Processor</key>
			<string>AutoPkgSourceFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%autopkg_path%/Code/autopkglib/version.plist</string>
				<key>plist_version_key</key>
				<string>Version</string>
			</dict>
			<key>Comment</key>
			<string>Extract a version string from version.plist to use for the package.</string>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Library</key>
					<string>01755</string>
					<key>Library/AutoPkg</key>
					<string>0755</string>
					<key>Library/AutoPkg/autopkglib</key>
					<string>0755</string>
					<key>Library/AutoPkg/autopkgserver</key>
					<string>0755</string>
					<key>Library/LaunchDaemons</key>
					<string>0755</string>
					<key>usr</key>
					<string>0755</string>
					<key>usr/local</key>
					<string>0755</string>
					<key>usr/local/bin</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/autopkg_root</string>
			</dict>
			<key>Comment</key>
			<string>Create a pkg root; we'll extract things from the disk image here.</string>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Library/AutoPkg/autopkg</string>
				<key>source_path</key>
				<string>%autopkg_path%/Code/autopkg</string>
			</dict>
			<key>Comment</key>
			<string>Copy autopkg to /Library/AutoPkg</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/usr/local/bin/autopkg</string>
				<key>source_path</key>
				<string>/Library/AutoPkg/autopkg</string>
			</dict>
			<key>Comment</key>
			<string>Symlink /Library/AutoPkg/autopkg to /usr/local/bin/autopkg</string>
			<key>Processor</key>
			<string>Symlinker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Library/AutoPkg/autopkglib</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%autopkg_path%/Code/autopkglib</string>
			</dict>
			<key>Comment</key>
			<string>Copy autopkglib to /Library/AutoPkg</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Library/AutoPkg/autopkgserver</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%autopkg_path%/Code/autopkgserver</string>
			</dict>
			<key>Comment</key>
			<string>Copy autopkgserver to /Library/AutoPkg</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Library/AutoPkg/FoundationPlist</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%autopkg_path%/Code/FoundationPlist</string>
			</dict>
			<key>Comment</key>
			<string>Copy FoundationPlist to /Library/AutoPkg</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Library/LaunchDaemons/com.github.autopkg.autopkgserver.plist</string>
				<key>source_path</key>
				<string>%autopkg_path%/Code/autopkgserver/autopkgserver.plist</string>
			</dict>
			<key>Comment</key>
			<string>Copy autopkgserver launchd plist</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Library/LaunchDaemons/com.github.autopkg.autopkginstalld.plist</string>
				<key>source_path</key>
				<string>%autopkg_path%/Code/autopkgserver/autopkginstalld.plist</string>
			</dict>
			<key>Comment</key>
			<string>Copy autopkginstalld launchd plist</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%pkgroot%/Library/AutoPkg/autopkgserver/autopkgserver.plist</string>
					<string>%pkgroot%/Library/AutoPkg/autopkgserver/autopkginstalld.plist</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Remove source launchd plists</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
				<key>template_path</key>
				<string>PackageInfoTemplate</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Comment</key>
			<string>Make PackageInfo file for our package</string>
			<key>Processor</key>
			<string>PkgInfoCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>usr</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>0755</string>
							<key>path</key>
							<string>Library/AutoPkg/autopkg</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>0644</string>
							<key>path</key>
							<string>Library/LaunchDaemons/com.github.autopkg.autopkgserver.plist</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.github.autopkg.autopkg</string>
					<key>infofile</key>
					<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>resources</key>
					<string>Resources</string>
					<key>scripts</key>
					<string>Scripts</string>
				</dict>
				<key>pkgname</key>
				<string>%NAME%-%version%</string>
			</dict>
			<key>Comment</key>
			<string>Build the package</string>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
