<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Rebuilds Munki catalogs in munki_repo_path if any other recipe in the same autopkg run imported something.
Use -k force_rebuild=YES to force a rebuild.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.munki.makecatalogs</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>munki_repo_path</key>
				<string>%MUNKI_REPO%</string>
			</dict>
			<key>Processor</key>
			<string>MakeCatalogsProcessor</string>
		</dict>
	</array>
</dict>
</plist>
