<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the current release version of Coda 2.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.install.coda2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Coda2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.coda2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
