<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Fetches the latest Sassafras KeyClient Mac installer.

REVISION is the major version without a decimal, for example:
7.0: 70
7.1: 71
7.2: 72
7.3: 73

This recipe supports only a REVISION of 70 and up. If REVISION
is set to an empty string, the latest version will be retrieved.
</string>
	<key>Identifier</key>
	<string>com.github.autopkg.download.sassafras-k2client</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>K2Client</string>
		<key>REVISION</key>
		<string>73</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://www.sassafras.com/k2/revisions%REVISION%/current/Installers/Macintosh%20Installers/Client/K2Client.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Sassafras Software, Inc.</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
