<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Puppet using Puppet Labs' Mac download list at
downloads.puppetlabs.com/mac.

Note that Puppet requires Facter.

VERSION can be overridden with a specific version number, or left to
the default, 'latest'.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.download.puppet</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Puppet</string>
		<key>VERSION</key>
		<string>latest</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>get_version</key>
				<string>%VERSION%</string>
				<key>product_name</key>
				<string>puppet</string>
			</dict>
			<key>Processor</key>
			<string>PuppetlabsProductsURLProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
