<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Adobe AIR installer and repackages it for unattended, silent installation.
Based on jamesz's work here: https://github.com/jamesez/automunki/tree/master/adobe-air</string>
	<key>Identifier</key>
	<string>com.github.autopkg.pkg.AdobeAIR</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdobeAIR</string>
		<key>URL</key>
		<string>http://airdownload.adobe.com/air/mac/download/latest/AdobeAIR.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.AdobeAIR</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>01775</string>
					<key>Applications/Adobe</key>
					<string>0775</string>
					<key>Applications/Adobe/Flash Player</key>
					<string>0775</string>
					<key>Applications/Adobe/Flash Player/AddIns</key>
					<string>0775</string>
					<key>Applications/Adobe/Flash Player/AddIns/airappinstaller</key>
					<string>0775</string>
					<key>Applications/Utilities</key>
					<string>0775</string>
					<key>Library</key>
					<string>01775</string>
					<key>Library/Frameworks</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/AdobeAIR</string>
			</dict>
			<key>Comment</key>
			<string>Create a pkg root; we'll extract things from the disk image here.</string>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/Utilities/Adobe AIR Uninstaller.app</string>
				<key>source_path</key>
				<string>%pathname%/Adobe AIR Installer.app</string>
			</dict>
			<key>Comment</key>
			<string>Copy AIR installer as Adobe AIR Uninstaller.app(!)</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Library/Frameworks/Adobe AIR.framework</string>
				<key>source_path</key>
				<string>%pkgroot%/Applications/Utilities/Adobe AIR Uninstaller.app/Contents/Frameworks/Adobe AIR.framework</string>
			</dict>
			<key>Comment</key>
			<string>Copy embedded Adobe AIR.framework to pkgroot/Library/Frameworks/</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%pkgroot%/Applications/Utilities/Adobe AIR Uninstaller.app/Contents/Frameworks/Adobe AIR.framework/Versions/Current/Adobe AIR Application Installer.app</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Remove unneeded Adobe AIR Application Installer.app from inside Uninstaller.app</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Library/Frameworks/Adobe AIR.framework/Versions/Current/Resources/Adobe AIR Updater.app</string>
				<key>source_path</key>
				<string>%pkgroot%/Applications/Utilities/Adobe AIR Uninstaller.app</string>
			</dict>
			<key>Comment</key>
			<string>Copy AIR Adobe AIR Uninstaller.app as Adobe AIR Updater.app (!) (Yes, this is getting silly.)</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%pkgroot%/Library/Frameworks/Adobe AIR.framework/Versions/Current/Resources/Adobe AIR Updater.app/Contents/Frameworks</string>
				</array>
			</dict>
			<key>Comment</key>
			<string>Remove Frameworks directory from Adobe AIR Updater.app</string>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/Utilities/Adobe AIR Application Installer.app</string>
				<key>source_path</key>
				<string>%pkgroot%/Library/Frameworks/Adobe AIR.framework/Versions/Current/Adobe AIR Application Installer.app</string>
			</dict>
			<key>Comment</key>
			<string>Copy embedded Adobe AIR Application Installer.app to /Applications/Utilities</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/Adobe/Flash Player/AddIns/airappinstaller/airappinstaller</string>
				<key>source_path</key>
				<string>%pkgroot%/Library/Frameworks/Adobe AIR.framework/Resources/airappinstaller</string>
			</dict>
			<key>Comment</key>
			<string>Copy embedded airappinstaller tool to /Applications/Adobe/Flash Player/AddIns/airappinstaller/</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/Adobe/Flash Player/AddIns/airappinstaller/airappinstaller/..namedfork/rsrc</string>
				<key>source_path</key>
				<string>%pkgroot%/Library/Frameworks/Adobe AIR.framework/Resources/airappinstaller.rsrc</string>
			</dict>
			<key>Comment</key>
			<string>Copy and merge resource fork for airappinstaller tool</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/Adobe/Flash Player/AddIns/airappinstaller/digest.s</string>
				<key>source_path</key>
				<string>%pkgroot%/Library/Frameworks/Adobe AIR.framework/Resources/digest.s</string>
			</dict>
			<key>Comment</key>
			<string>Copy digest.s (library?) for airappinstaller tool</string>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pkgroot%/Applications/Utilities/Adobe AIR Application Installer.app/Contents/Info.plist</string>
				<key>output_plist_path</key>
				<string>%pkgroot%/Applications/Utilities/Adobe AIR Application Installer.app/Contents/Info.plist</string>
				<key>plist_data</key>
				<dict>
					<key>CFBundleDocumentTypes</key>
					<array>
						<dict>
							<key>CFBundleTypeExtensions</key>
							<array>
								<string>air</string>
							</array>
							<key>CFBundleTypeIconFile</key>
							<string>Adobe AIR Installer Package.icns</string>
							<key>CFBundleTypeMIMETypes</key>
							<array>
								<string>application/vnd.adobe.air-application-installer-package+zip</string>
							</array>
							<key>CFBundleTypeName</key>
							<string>com.adobe.air.InstallerPackage</string>
							<key>CFBundleTypeRole</key>
							<string>Viewer</string>
						</dict>
					</array>
				</dict>
			</dict>
			<key>Comment</key>
			<string>Make Adobe AIR Application Installer.app be able to open .air files</string>
			<key>Processor</key>
			<string>PlistEditor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pkgroot%/Library/Frameworks/Adobe AIR.framework/Resources/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Comment</key>
			<string>Get Adobe AIR version from the framework bundle</string>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>infofile</key>
				<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
				<key>pkgtype</key>
				<string>flat</string>
				<key>template_path</key>
				<string>PackageInfoTemplate</string>
			</dict>
			<key>Comment</key>
			<string>Make PackageInfo file for our package</string>
			<key>Processor</key>
			<string>PkgInfoCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.adobe.pkg.AIR</string>
					<key>infofile</key>
					<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>resources</key>
					<string>Resources</string>
				</dict>
				<key>pkgname</key>
				<string>%NAME%-%version%</string>
			</dict>
			<key>Comment</key>
			<string>Finally! Build a real Apple package from Adobe's Inception-esque blob</string>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
