<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports a pre-built Munki 2 from
https://munkibuilds.org. DOWNLOAD_URL can be overridden to
an alternate URL, from either your own server or an alternate
package version, ie.
https://munkibuilds.org/2.2.2.2416/munkitools-2.2.2.2416.pkg</string>
	<key>Identifier</key>
	<string>com.github.autopkg.munki.munkitools2-autobuild</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://munkibuilds.org/munkitools2-latest.pkg</string>
		<key>MUNKITOOLS_ADMIN_DESCRIPTION</key>
		<string>Command-line Managed Software Center admin tools.</string>
		<key>MUNKITOOLS_ADMIN_DISPLAYNAME</key>
		<string>Managed Software Center admin tools</string>
		<key>MUNKITOOLS_ADMIN_NAME</key>
		<string>munkitools_admin</string>
		<key>MUNKITOOLS_APP_DESCRIPTION</key>
		<string>Managed Software Center application.</string>
		<key>MUNKITOOLS_APP_DISPLAYNAME</key>
		<string>Managed Software Center</string>
		<key>MUNKITOOLS_APP_NAME</key>
		<string>munkitools</string>
		<key>MUNKITOOLS_CORE_DESCRIPTION</key>
		<string>Core command-line tools used by Managed Software Center.</string>
		<key>MUNKITOOLS_CORE_DISPLAYNAME</key>
		<string>Managed Software Center core tools</string>
		<key>MUNKITOOLS_CORE_NAME</key>
		<string>munkitools_core</string>
		<key>MUNKITOOLS_LAUNCHD_DESCRIPTION</key>
		<string>launchd configuration files for use by Managed Software Center.</string>
		<key>MUNKITOOLS_LAUNCHD_DISPLAYNAME</key>
		<string>Managed Software Center launchd files</string>
		<key>MUNKITOOLS_LAUNCHD_NAME</key>
		<string>munkitools_launchd</string>
		<key>MUNKI_CATALOG</key>
		<string>development</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>munkitools</string>
		<key>NAME</key>
		<string>munkitools2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/repack</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpack/munkitools_core*</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_pkg</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_core.pkg</string>
				<key>source_flatpkg_dir</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgPacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpack/munkitools_admin*</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_pkg</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_admin.pkg</string>
				<key>source_flatpkg_dir</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgPacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpack/munkitools_app*</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_pkg</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_app.pkg</string>
				<key>source_flatpkg_dir</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgPacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpack/munkitools_launchd*</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_pkg</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_launchd.pkg</string>
				<key>source_flatpkg_dir</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgPacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_core.pkg</string>
				<key>pkginfo</key>
				<dict>
					<key>catalogs</key>
					<array>
						<string>%MUNKI_CATALOG%</string>
					</array>
					<key>description</key>
					<string>%MUNKITOOLS_CORE_DESCRIPTION%</string>
					<key>display_name</key>
					<string>%MUNKITOOLS_CORE_DISPLAYNAME%</string>
					<key>minimum_os_version</key>
					<string>10.6.0</string>
					<key>name</key>
					<string>%MUNKITOOLS_CORE_NAME%</string>
					<key>requires</key>
					<array>
						<string>%MUNKITOOLS_LAUNCHD_NAME%</string>
					</array>
					<key>unattended_install</key>
					<true/>
				</dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_admin.pkg</string>
				<key>pkginfo</key>
				<dict>
					<key>catalogs</key>
					<array>
						<string>%MUNKI_CATALOG%</string>
					</array>
					<key>description</key>
					<string>%MUNKITOOLS_ADMIN_DESCRIPTION%</string>
					<key>display_name</key>
					<string>%MUNKITOOLS_ADMIN_DISPLAYNAME%</string>
					<key>minimum_os_version</key>
					<string>10.6.0</string>
					<key>name</key>
					<string>%MUNKITOOLS_ADMIN_NAME%</string>
					<key>unattended_install</key>
					<true/>
					<key>update_for</key>
					<array>
						<string>%MUNKITOOLS_CORE_NAME%</string>
					</array>
				</dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_app.pkg</string>
				<key>pkginfo</key>
				<dict>
					<key>catalogs</key>
					<array>
						<string>%MUNKI_CATALOG%</string>
					</array>
					<key>description</key>
					<string>%MUNKITOOLS_APP_DESCRIPTION%</string>
					<key>display_name</key>
					<string>%MUNKITOOLS_APP_DISPLAYNAME%</string>
					<key>minimum_os_version</key>
					<string>10.6.0</string>
					<key>name</key>
					<string>%MUNKITOOLS_APP_NAME%</string>
					<key>requires</key>
					<array>
						<string>%MUNKITOOLS_CORE_NAME%</string>
						<string>%MUNKITOOLS_LAUNCHD_NAME%</string>
					</array>
					<key>unattended_install</key>
					<true/>
				</dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_launchd.pkg</string>
				<key>pkginfo</key>
				<dict>
					<key>catalogs</key>
					<array>
						<string>%MUNKI_CATALOG%</string>
					</array>
					<key>description</key>
					<string>%MUNKITOOLS_LAUNCHD_DESCRIPTION%</string>
					<key>display_name</key>
					<string>%MUNKITOOLS_LAUNCHD_DISPLAYNAME%</string>
					<key>minimum_os_version</key>
					<string>10.6.0</string>
					<key>name</key>
					<string>%MUNKITOOLS_LAUNCHD_NAME%</string>
				</dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
