<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest OmniGroupProduct. This is an abstract base recipe intended to be overridden.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.download.omnigroupproduct</string>
	<key>Input</key>
	<dict>
		<key>APPCAST_URL</key>
		<string>http://update.omnigroup.com/appcast/com.omnigroup.%NAME%</string>
		<key>NAME</key>
		<string>OmniGroupProduct</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>alternate_xmlns_url</key>
				<string>http://www.omnigroup.com/namespace/omniappcast/v1</string>
				<key>appcast_url</key>
				<string>%APPCAST_URL%</string>
			</dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
